Revit 2024 API
FormulaManager.GetFunctions Method
 Gets list of function names supported by formula engine
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static IList<string> GetFunctions()
Visual Basic
Public Shared Function GetFunctions As IList(Of String)
Visual C++
public:
static IList<String^>^ GetFunctions()
See Also
FormulaManager Class
Autodesk.Revit.DB Namespace